v2206/urban_Microclimate/streetCanyon_CFDHAM_grass/constant/air/grassProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      grassProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

grassModel  simpleGrass;

simpleGrassCoeffs
{
    grassPatches
    (
        air_to_street
    );

    Cd 0.2;
    LAI 2;
    LAD 20;
    nEvapSides 1;
    beta 0.5;
    betaLW 1000;
    albedoSoil 0.4;
}

// Number of flow iterations per grass iteration
solverFreq 1;

// ************************************************************************* //
