v2206/urban_Microclimate/streetCanyon_CFDHAM_grass/0/air/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5 0 0); 

boundaryField
{
    #include "include/ABLConditions"

    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions"
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (5 0 0); 
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    air_to_street
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    air_to_windward
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    air_to_leeward
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    side1
    {
        type            slip;
    }
    side2
    {
        type            slip;
    }
    buildings
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
