v2206/urban_Microclimate/streetCanyon_CFDHAM_grass/0/air/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 285.0; 

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    tableFile;
        uniformValueCoeffs
        {
            file        "$FOAM_CASE/0/air/Tambient";
        }
        value           uniform 285.0; 
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 285.0;
        value           uniform 285.0; 
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            zeroGradient;
    }
    air_to_street
    {
        type            compressible::CFDHAMfluidTemperatureCoupledMixed;
        value           uniform 300.0;
    }
    air_to_windward
    {
        type            compressible::CFDHAMfluidTemperatureCoupledMixed;
        value           uniform 300.0;
    }
    air_to_leeward
    {
        type            compressible::CFDHAMfluidTemperatureCoupledMixed;
        value           uniform 300.0;
    }
    side1
    {
        type            slip;
    }
    side2
    {
        type            slip;
    }
    buildings
    {
        type            fixedValue;
        value           uniform 300.0; 
    }
}


// ************************************************************************* //
