v2206/urban_Microclimate/streetCanyon_CFDHAM_grass/system/air/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    air_to_street
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    street;
        samplePatch     street_to_air;
        offsetMode      uniform;
        offset          (0 0 0);
    }
    air_to_windward
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    windward;
        samplePatch     windward_to_air;
        offsetMode      uniform;
        offset          (0 0 0);
    }
    air_to_leeward
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    leeward;
        samplePatch     leeward_to_air;
        offsetMode      uniform;
        offset          (0 0 0);
    }
}

// ************************************************************************* //
